[
  {
    "question_text": "У Маши было 5 яблок. Она отдала 2 яблока Пете. Сколько яблок осталось у Маши?",
    "options": [
      "2",
      "3",
      "4",
      "5"
    ],
    "answer": 1
  },
  {
    "question_text": "У Маши было 3 яблока, а у Пети 5 яблок. Петя отдал Маше 1 яблоко. Сколько всего яблок стало у Маши и Пети вместе?",
    "options": [
      "7",
      "8",
      "9",
      "10"
    ],
    "answer": 1
  },
  {
    "question_text": "У Пети было 5 яблок. Он отдал 2 яблока Маше. Сколько яблок осталось у Пети?",
    "options": [
      "1",
      "4",
      "3",
      "2"
    ],
    "answer": 2
  },
  {
    "question_text": "У Пети было 3 яблока, а Маша дала ему ещё 4 яблока. Сколько яблок стало у Пети?",
    "options": [
      "5",
      "6",
      "7",
      "8"
    ],
    "answer": 2
  },
  {
    "question_text": "У Саши было 8 конфет. Он съел 3 конфеты, а потом мама дала ему ещё 2 конфеты. Сколько конфет стало у Саши?",
    "options": [
      "5",
      "6",
      "7",
      "9"
    ],
    "answer": 2
  },
  {
    "question_text": "У Коли было 9 марок. Он потерял 2 марки, а потом нашёл 1 марку. Сколько марок стало у Коли?",
    "options": [
      "6",
      "7",
      "8",
      "10"
    ],
    "answer": 2
  },
  {
    "question_text": "У Лизы было 4 карандаша. Она купила ещё 3 карандаша, а потом 2 карандаша сломались. Сколько карандашей осталось у Лизы?",
    "options": [
      "3",
      "4",
      "5",
      "7"
    ],
    "answer": 2
  },
  {
    "question_text": "У Вани было 7 рыбок в аквариуме. Он купил ещё 2 рыбки, но потом 3 рыбки уплыли. Сколько рыбок осталось у Вани?",
    "options": [
      "4",
      "5",
      "6",
      "8"
    ],
    "answer": 2
  },
  {
    "question_text": "На тарелке лежало 6 пирожков.  Маша съела 2 пирожка, а потом папа положил на тарелку ещё 3 пирожка. Сколько пирожков стало на тарелке?",
    "options": [
      "9",
      "5",
      "7",
      "4"
    ],
    "answer": 2
  },
  {
    "question_text": "У Ани было 10 наклеек. Она подарила 3 наклейки подруге, а потом 1 наклейку потеряла. Сколько наклеек осталось у Ани?",
    "options": [
      "7",
      "5",
      "6",
      "4"
    ],
    "answer": 2
  },
  {
    "question_text": "В вазе было 8 конфет. Миша взял 3 конфеты, а потом бабушка добавила в вазу еще 4 конфеты. Сколько конфет стало в вазе?",
    "options": [
      "7",
      "9",
      "12",
      "5"
    ],
    "answer": 1
  },
  {
    "question_text": "На ветке сидело 5 птиц.  Прилетели ещё 3 птицы, а потом 2 птицы улетели. Сколько птиц осталось на ветке?",
    "options": [
      "4",
      "6",
      "8",
      "10"
    ],
    "answer": 1
  },
  {
    "question_text": "В коробке лежало 7 карандашей. Оля взяла 2 карандаша, а потом папа добавил в коробку ещё 4 карандаша. Сколько карандашей стало в коробке?",
    "options": [
      "13",
      "9",
      "5",
      "11"
    ],
    "answer": 1
  },
  {
    "question_text": "У Димы было 6 машинок. Он подарил 2 машинки другу, а потом папа купил ему ещё 3 машинки. Сколько машинок стало у Димы?",
    "options": [
      "5",
      "7",
      "1",
      "9"
    ],
    "answer": 1
  },
  {
    "question_text": "В автобусе ехало 6 пассажиров. На остановке вышли 3 пассажира, а вошли 5 пассажиров. Сколько пассажиров стало в автобусе?",
    "options": [
      "8",
      "4",
      "9",
      "2"
    ],
    "answer": 0
  },
  {
    "question_text": "На клумбе росло 4 тюльпана и 5 ромашек. Садовник срезал 3 ромашки. Сколько всего цветов осталось на клумбе?",
    "options": [
      "9",
      "6",
      "2",
      "7"
    ],
    "answer": 3
  },
  {
    "question_text": "У Лены было 9 рублей. Она купила ручку за 3 рубля и ластик за 2 рубля. Сколько рублей осталось у Лены?",
    "options": [
      "6",
      "4",
      "5",
      "7"
    ],
    "answer": 1,
    "solution": "1) Сначала найдём, сколько всего рублей потратила Лена: 3 + 2 = 5 рублей.\n2) Теперь найдём, сколько рублей осталось у Лены: 9 - 5 = 4 рубля."
  },
  {
    "question_text": "В корзине лежало 8 яблок.  Из корзины взяли 2 красных яблока и 3 зеленых яблока. Сколько яблок осталось в корзине?",
    "options": [
      "5",
      "4",
      "3",
      "6"
    ],
    "answer": 2,
    "solution": "1) Сначала найдём, сколько всего яблок взяли из корзины: 2 + 3 = 5 яблок.\n2) Теперь найдём, сколько яблок осталось в корзине: 8 - 5 = 3 яблока."
  }
]